tutorials/precursorABL/generic.unstable/0.original/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

U0                  (8.0 0.0 0.0);
p_rgh0               0.0;
T0                   300.0;
TGradUpper           0.003;
nuSgs0               0.0;
kappat0              0.0;
flm0                 2.56E-6;
fmm0                 1.00E-4;
k0                   0.1;

qwall               (0.0 0.0 -0.1);
Rwall               (0.0 0.0 0.0 0.0 0.0 0.0);
kappa                0.4;
z0                   0.1;
betaM                16.0;
gammaM               5.0;
betaH                9.0;
gammaH               7.8;
alphaH               1.0;


#inputMode           merge

// ************************************************************************* //

